vbuzyan/Esp32-p4/boards/crowpanel_advanced_9inch_p4/sdkconfig.defaults
# sdkconfig.defaults — GhostESP board-profile seed for CrowPanel 9" ESP32-P4 V1.0
# ============================================================================
# Starting Kconfig overlay for porting GhostESP (Phase 2). Seed, then expand via
# `idf.py set-target esp32p4 && idf.py menuconfig`. The autogenerated
# CONFIG_SOC_* values come from ESP-IDF. Verified working values mirror the
# Phase-1 bring-up in ../../firmware/.
# ============================================================================

# --- Target + silicon rev (this board is early P4, rev v1.3) ----------------
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --- Flash / PSRAM ----------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# --- Board identity (GhostESP) ----------------------------------------------
CONFIG_BUILD_CONFIG_TEMPLATE="crowpanel_p4_9inch"

# --- Display: 1024x600 EK79007 MIPI-DSI (driver added in Phase 2) -----------
CONFIG_WITH_SCREEN=y
CONFIG_TFT_WIDTH=1024
CONFIG_TFT_HEIGHT=600
# Do NOT enable CONFIG_LCD_DSI_ISR_IRAM_SAFE (forces the DSI vsync callback into
# IRAM; the LVGL flush callback isn't IRAM-placed → registration fails).

# --- Touch: GT911 I2C0 SCL46 SDA45 INT42 RST40 ------------------------------
# (enable GhostESP's GT911 option + set pins in Phase 2)

# --- GhostLink UART to the radio module (set TX/RX to free GPIOs, not 6/7) ---

# --- Logging ----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
